Revit 2024 API
HermiteSplineTangents Constructor
 Constructs a new default instance of the class, with tangent vectors uninitialized.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public HermiteSplineTangents()
Visual Basic
Public Sub New
Visual C++
public:
HermiteSplineTangents()
See Also
HermiteSplineTangents Class
Autodesk.Revit.DB Namespace